<template>
    <!-- The Modal -->
    <div id="myModal" class="modal">
        <!-- Modal content -->
        <div class="modal-content">
            <div class="w-full">
                <span @click.prevent="closeRules" class="close">&times;</span>
                <div class="text-center font-bold text-xl pt-5">
                    Правила гостевой книги
                    </div>
                <div class="p-5">
                <b>Запрещается*:</b>
                <ul class="pl-5">
                    <li type="disc">Призывать к нарушению действующего законодательства,
                        разжигать межнациональную рознь и все прочее, что попадает под действие УК РФ;</li>
                    <li type="disc">Размещать рекламные ссылки или ссылки на сайты, нарушающие федеральные законы, в том
                        числе Закон от 27 июля 2006 года №149-ФЗ "Об информации, информационных технологиях и о защите
                        информации";</li>
                    <li type="disc">Использовать оскорбления в любой форме (в т.ч. команд, городов);</li>
                    <li type="disc">Использовать оскорбления или проявлять в комментариях крайнее неуважение к клубу
                        СКА-Хабаровск, его игрокам, тренерам, сотрудникам администрации;</li>
                    <li type="disc">Писать исключительно заглавными буквами, непрерывным текстом;</li>
                    <li type="disc">Многочисленные сообщения идущие подряд от одного пользователя (флуд);</li>
                </ul>
                <br>
                <b>Не поощряется и может привести к удалению сообщений (на усмотрение администраторов)*:</b>
                <ul class="pl-5">
                    <li type="disc">Обсуждение тем не связанных с футболом (всегда), обсуждение футбольных тем, не
                        связанных со СКА и городом Хабаровском (в период проведения Чемпионата России).</li>
                    <li type="disc">Неоднократно обращаться к конкретным посетителям
                        гостевой книги по личным вопросам, представляющим интерес только для них.</li>
                    <li type="disc">Злоупотребление смайликами.</li>
                </ul>
                    <br>
                * данные списки могут дополняться
                <br>
                <br><div>1. Отправка Вами любого сообщения в Гостевую книгу сайта означает
                    Ваше автоматическое согласие с данными Правилами и обязательное их соблюдение.</div>
                    <div>2. Гостевая книга является постмодерируемой,
                        т.е. добавление сообщений происходит сразу, а отслеживание
                        их содержания позже. Все сообщения отражают мнения только их
                        авторов, и <strong>администрация сайта не несет никакой ответственности за чужие
                            мнения</strong>.</div>
                        <div>3. За нарушение правил посетитель получает
                            замечание или предупреждение. За многократные нарушения, а так же серьезные
                            проступки (злоупотребление ненормативной лексикой, оскорбление собеседников,
                            призывы к противоправным действиям и т.п.) доступ к гостевой книге в том или
                            ином виде будет ограничен на определенный срок.</div>
                            <div>4. Администрация сайта <strong>всегда</strong> имеет право
                                удалять сообщения, нарушающие установленный порядок и противоречащие правилам
                                поведения на гостевой книге <strong>без какого-то предупреждения и
                                    объяснений; </strong>
                                блокировать доступ нарушителей или к отправке сообщений, или полностью к гостевой
                                книге.</div>
                    </div>
            </div>
        </div>
    </div>

</template>

<script>
export default {
    name: "Rules",
    props: [
      'trigger'
    ],
    mounted() {
        if (this.trigger) {
            this.showRules()
        }
    },
    methods: {
        showRules() {
            document.getElementById("myModal").style.display = "block";
        },
        closeRules() {
            document.getElementById("myModal").style.display = "none";
            this.$parent.rulesOpened = false
        },
    }
}
</script>

<style scoped>

</style>
